[
  {
    "text": "Is Microsoft still interested in engineering a streaming-only console to stand alongside Xbox Project Scarlett? A new report suggests that is indeed the case, with Microsoft preparing to bet big on Project xCloud as it prepares a digital-only variant of Xbox Project Scarlett. One of the biggest surprises of the Xbox E3 2019 showcase wasn't an announcement but an absence. As the company teased its next generation offering – Xbox Project Scarlett, releasing in 2020 alongside Halo Infinite – many were surprised to see just the one console being discussed up on stage. That's because rumours have persisted for months now that Microsoft is building two systems for the next-generation, codenamed Anaconda and Lockhart. "
  },

  {
    "text": "Like many of you, we’ve been bingeing Stranger Things season 3 since it came out in the early hours of 4 July. Spending summertime in Hawkins, Indiana, instead of visiting in the darker autumn months, marks a nice change in tone for the series. Stranger Things season 3 introduces us to new heroes, new villains and even some new settings, including the neon-mad Starcourt Mall.For the many of you who have sprinted through the new series, we’ve assembled this handy guide with 10 Easter eggs from each episode that you may have missed. Some of them offer clues regarding the plot; some are varyingly tenuous pop-culture references and homages to the time Stranger Things takes place (the mid-’80s). Some are just there for fun (or are they?). "
  },
  {
    "text": "Move over Fortnite, Ratchet and Clank's bonkers weapons have had a decade headstart on getting your enemies to wiggle their way to defeat. While Epic Games' own Boogie Bomb has become the best trolling gadget for GamesRadar's regular Fortnite sessions, Ratchet and Clank's Groovitron has been getting on down since 2007 when it was introduced in the PS3 title, Ratchet and Clank: Tools of Destruction. And oh boy, what a tool it is. Basically a disco ball embedded in a glove, when it's thrown out the sparkling ball flies into the air, and plays disco music that mesmerizes anything near it to dance uncontrollably for a short space of time. Catching any enemies mid-Night Fever pose with a thwack of your trusty OmniWrench meant you could usually take them out in one shot. Handy, and snazzy. The best combo. Sam Loveridge"
  }
]